import { Cursor, useTypewriter } from "react-simple-typewriter";

import { ChatBot, CookieModal, Footer, Header, LearnMore } from "../../index";
import "./home.scss";

export const HomePage = () => {
  const [text] = useTypewriter({
    words: [
      "побудувати мій кавовий бізнес?",
      "масштабувати мій бізнес без зусиль?",
      "підняти мій бізнес на новий рівень за допомогою ШІ?",
      "автоматизувати бізнес-процеси?",
    ],
    loop: 100,
    typeSpeed: 200,
    deleteSpeed: 180,
  });
  return (
    <>
      <Header />
      <section className="home container">
        <section className="main">
          <h1 className="main__title">
            <span className="marked">Бізнес</span> будують успішні <br />
            люди з допомогою <span className="marked">ШІ</span>
          </h1>
          <h3 className="main__subtitle">
            Як {text}
            <span>
              <Cursor cursorStyle="|" />
            </span>
          </h3>
        </section>

        <article className="works">
          <h2 className="works__title">Як це працює?</h2>
          <div className="works__content">
            <div className="works__item">
              <div className="img_temp"></div>
              <div className="works__item-text">
                <h3>Актуальні новини бізнесу</h3>
                <p>
                  Будьте в курсі останніх подій у світі бізнесу – аналітика,
                  ринкові тренди, зміни в законодавстві та інсайти від провідних
                  компаній. Фільтруйте новини за категоріями, шукайте потрібні
                  теми або компанії та отримуйте персоналізовані рекомендації
                  від АІ. Взаємодійте з контентом – залишайте вподобайки,
                  коментарі та оцінюйте якість підбору. Формуйте власну стрічку
                  актуальних новин, яка відповідає вашим інтересам
                </p>
                <LearnMore text="Дізнатись більше" />
              </div>
            </div>
            <div className="works__item works__item-reverse">
              <div className="works__item-text">
                <h3>Як працює ШІ для підбору рекомендацій?</h3>
                <p>
                  Штучний інтелект аналізує ваші інтереси та взаємодію з
                  контентом, щоб створити персоналізовану стрічку. Ви можете
                  налаштувати параметри рекомендацій у власному кабінеті,
                  визначаючи, які теми та типи контенту вам цікаві.
                  <ul>
                    <li>
                      ✅ Взаємодійте з контентом – ставте вподобайки, дизлайки
                      та коментуйте публікації, щоб система краще розуміла ваші
                      уподобання.
                    </li>
                    <li>
                      ⭐ Оцінюйте якість підбору – якщо допис запропонований АІ,
                      ви можете оцінити його релевантність.
                    </li>
                    <li>
                      🔄 Керуйте своїми рекомендаціями – якщо вас зацікавив
                      певний контент, натисніть «Показувати більше такого», щоб
                      отримувати схожі матеріали.
                    </li>
                  </ul>
                  Алгоритм аналізує ваші дії та надсилає запит до ШІ, який
                  визначає релевантні теги та фільтрує публікації, формуючи
                  ідеальну стрічку для вас
                </p>
                <LearnMore text="Дізнатись більше" />
              </div>
              <div className="img_temp"></div>
            </div>
            <div className="works__item">
              <div className="img_temp"></div>
              <div className="works__item-text">
                <h3>Як працює АІ-консультант?</h3>
                <p>
                  АІ-консультант створений для того, щоб надавати корисні та
                  персоналізовані поради на основі ваших налаштувань і
                  інтересів.
                  <ul>
                    <li>
                      💡 Індивідуальні відповіді – ШІ аналізує ваш профіль і
                      пропонує рішення, які можуть вас зацікавити.
                    </li>
                    <li>
                      🔍 Розумні підказки – якщо ви не знаєте, що запитати,
                      система запропонує ймовірне питання, яке може бути для вас
                      актуальним.
                    </li>
                    <li>
                      ⚙ Гнучкі налаштування – ви можете коригувати свої
                      уподобання, щоб отримувати ще більш точні рекомендації.
                    </li>
                  </ul>
                  АІ-консультант завжди готовий допомогти вам знайти відповіді
                  на важливі питання! 🚀
                </p>
                <LearnMore text="Дізнатись більше" />
              </div>
            </div>
            <div className="works__item works__item-reverse">
              <div className="works__item-text">
                <h3>Ком’юніті: обговорення та чати на бізнес-теми</h3>
                <p>
                  Спілкуйтеся з однодумцями, обговорюйте тренди та діліться
                  досвідом у спеціальних бізнес-чатах і тредах.
                  <ul>
                    <li>
                      💬 Дискусії за інтересами – приєднуйтеся до обговорень у
                      вибраних категоріях: стартапи, фінанси, маркетинг,
                      інвестиції тощо.
                    </li>
                    <li>
                      🤝 Обмін досвідом – ставте запитання, діліться ідеями та
                      отримуйте поради від підприємців та експертів.
                    </li>
                    <li>
                      📌 Актуальні теми – слідкуйте за трендовими тредами,
                      обговорюйте важливі новини та аналітику.
                    </li>
                    <li>
                      ⚙ Розумна модерація – система АІ допомагає знаходити
                      релевантні теми та фільтрує неякісний контент.
                    </li>
                  </ul>
                  Будьте в центрі ділового ком’юніті та знайомтеся з людьми, які
                  допоможуть вам рости у бізнесі!
                </p>
                <LearnMore text="Дізнатись більше" />
              </div>
              <div className="img_temp"></div>
            </div>
          </div>
        </article>
      </section>
      <ChatBot />
      <CookieModal />
      <Footer />
    </>
  );
};
