export const menuItems: string[] = [
  "Новини",
  "Тренди",
  "Для бізнесменів",
  "Для фрілансерів",
];

type MenuItem = {
  title: string;
  items: string[];
};

type MenuContent = {
  [key: string]: MenuItem[];
};

export const menuContent: MenuContent = {
  Новини: [
    {
      title: "Бізнес та економіка",
      items: [
        "Економіка та ринок",
        "Фінанси та інвестиції",
        "Бізнес у кризові часи",
      ],
    },
    {
      title: "Підприємництво та стартапи",
      items: [
        "Підприємництво та стартапи",
        "Експорт та міжнародний бізнес",
        "Маркетинг та продажі",
      ],
    },
    {
      title: "Технології та інновації",
      items: ["Цифрова трансформація", "Штучний інтелект та автоматизація"],
    },
    {
      title: "Кар'єра та саморозвиток",
      items: [
        "Фріланс та самозайнятість",
        "HR та кар'єра",
        "Лідерство та навички",
      ],
    },
    {
      title: "Здоров'я та якість життя",
      items: [
        "Здоров'я та добробут",
        "Баланс роботи та відпочинку",
        "Психологія успіху",
      ],
    },
  ],
  Тренди: [
    {
      title: "Штучний інтелект та автоматизація",
      items: [
        "АІ для автоматизації",
        "Гіперавтоматизація",
        "Гіперперсоналізація",
      ],
    },
    {
      title: "Кібербезпека та блокчейн",
      items: ["Кібербезпека", "Блокчейн та криптовалюти"],
    },
    {
      title: "Маркетинг та споживчий досвід",
      items: ["Емпіричний маркетинг", "Персоналізація користувацького досвіду"],
    },
    {
      title: "Стійкість та екологічність",
      items: ["Стійкість та екологічність", "Екологічні ініціативи в бізнесі"],
    },
    {
      title: "Нові робочі моделі",
      items: ["Віддалена робота та гібридні моделі", "Майбутнє праці"],
    },
  ],
  "Для бізнесменів": [
    {
      title: "Фінанси та інвестиції",
      items: ["Гранти, інвестиції та фінансування", "Оптимізація витрат"],
    },
    {
      title: "Навчання та розвиток",
      items: ["Вебінари від експертів", "Курси та майстер-класи"],
    },
    {
      title: "Партнерство та співпраця",
      items: ["Співпраця та партнерство", "Локальні та міжнародні партнерства"],
    },
    {
      title: "Бізнес-інструменти та технології",
      items: ["Підбірка бізнес-інструментів", "Інтеграція нових технологій"],
    },
    {
      title: "Законодавство та кейси",
      items: ["Зміни в законодавстві", "Кейси успішних компаній"],
    },
  ],
  "Для фрілансерів": [
    {
      title: "Робочий процес та ефективність",
      items: [
        "Інструменти для продуктивності",
        "Тайм-менеджмент для фрілансерів",
        "Автоматизація робочих процесів",
      ],
    },
    {
      title: "Пошук клієнтів та замовлень",
      items: [
        "Фріланс-біржі та платформи",
        "Нетворкінг та особистий бренд",
        "Як отримати довгострокових клієнтів",
      ],
    },
    {
      title: "Фінанси та легалізація",
      items: [
        "Оподаткування фрілансерів",
        "Як виставляти рахунки та отримувати оплату",
        "Фінансове планування та заощадження",
      ],
    },
    {
      title: "Розвиток навичок та навчання",
      items: [
        "Курси та сертифікації",
        "Як слідкувати за трендами у сфері",
        "Самоосвіта та прокачка навичок",
      ],
    },
    {
      title: "Психологія та робочий баланс",
      items: [
        "Як уникати вигорання",
        "Робота з мотивацією та дисципліною",
        "Баланс між роботою та особистим життям",
      ],
    },
  ],
};

export const contentTypes = [
  { type: "text", label: "Текст" },
  { type: "image", label: "Зображення" },
  { type: "video", label: "Відео" },
];

export const getFormattedTimeAndDate = () => {
  const now = new Date();

  const hours = String(now.getHours()).padStart(2, '0');
  const minutes = String(now.getMinutes()).padStart(2, '0');

  const year = String(now.getFullYear()).slice(-2);
  const month = String(now.getMonth() + 1).padStart(2, '0');
  const day = String(now.getDate()).padStart(2, '0');

  const time = `${hours}:${minutes}`;
  const date = `${day}.${month}.${year}`;

  return `${time + ', ' + date}`;
};

export const DEFAULT_AVATAR = "https://i.postimg.cc/3dPhnM8L/de7834s-6515bd40-8b2c-4dc6-a843-5ac1a95a8b55.jpg";